WSDL/RateService/Rate_v24/Rate  Intra EMEA.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/rate/v24">
   <SOAP-ENV:Body>
      <RateRequest>
         <WebAuthenticationDetail>
            <ParentCredential>
               <Key>Input Your Information</Key>
               <Password>Input Your Information</Password>
            </ParentCredential>
            <UserCredential>
               <Key>Input Your Information</Key>
               <Password>Input Your Information</Password>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>Input Your Information</AccountNumber>
            <MeterNumber>Input Your Information</MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>TC251_International Express With RETURN_SHIPMENT</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>crs</ServiceId>
            <Major>24</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2017-12-14T12:34:56-06:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>INTERNATIONAL_PRIORITY</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <PreferredCurrency>USD</PreferredCurrency>
            <Shipper>
               <Contact>
                  <PersonName>Input Your Information</PersonName>
                  <CompanyName>Input Your Information</CompanyName>
                  <PhoneNumber>Input Your Information</PhoneNumber>
                  <EMailAddress>sender@yahoo.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>StreetLines_101</StreetLines>
                  <City>HATFIELD</City>
                  <StateOrProvinceCode>HE</StateOrProvinceCode>
                  <PostalCode>AL10</PostalCode>
                  <CountryCode>GB</CountryCode>
               </Address>
            </Shipper>
            <Recipient>
               <Contact>
                  <PersonName>Input Your Information</PersonName>
                  <CompanyName>Input Your Information</CompanyName>
                  <PhoneNumber>Input Your Information</PhoneNumber>
                  <EMailAddress>recipient@yahoo.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Input Your Information</StreetLines>
                  <StreetLines>Input Your Information</StreetLines>
                  <City>Paris</City>
                  <StateOrProvinceCode>FR</StateOrProvinceCode>
                  <PostalCode>75008</PostalCode>
                  <CountryCode>FR</CountryCode>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>Input Your Information</AccountNumber>
                     <Tins>
                        <TinType>BUSINESS_STATE</TinType>
                        <Number>123456</Number>
                     </Tins>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            <CustomsClearanceDetail>
               <DutiesPayment>
                  <PaymentType>SENDER</PaymentType>
                  <Payor>
                     <ResponsibleParty>
                        <AccountNumber>Input Your Information</AccountNumber>
                     </ResponsibleParty>
                  </Payor>
               </DutiesPayment>
               <DocumentContent>DOCUMENTS_ONLY</DocumentContent>
               <CustomsValue>
                  <Currency>USD</Currency>
                  <Amount>100.00</Amount>
               </CustomsValue>
               <CommercialInvoice>
                  <TermsOfSale>FOB_OR_FCA</TermsOfSale>
               </CommercialInvoice>
               <Commodities>
                  <NumberOfPieces>1</NumberOfPieces>
                  <Description>ABCD</Description>
                  <CountryOfManufacture>HU</CountryOfManufacture>
                  <Weight>
                     <Units>LB</Units>
                     <Value>1.0</Value>
                  </Weight>
                  <Quantity>1</Quantity>
                  <QuantityUnits>cm</QuantityUnits>
                  <UnitPrice>
                     <Currency>USD</Currency>
                     <Amount>1.000000</Amount>
                  </UnitPrice>
                  <CustomsValue>
                     <Currency>USD</Currency>
                     <Amount>100.000000</Amount>
                  </CustomsValue>
               </Commodities>
               <ExportDetail>
                  <ExportComplianceStatement>30.37(f)</ExportComplianceStatement>
               </ExportDetail>
            </CustomsClearanceDetail>
            <RateRequestTypes>LIST</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <GroupNumber>1</GroupNumber>
               <GroupPackageCount>1</GroupPackageCount>
               <Weight>
                  <Units>LB</Units>
                  <Value>20.0</Value>
               </Weight>
               <Dimensions>
                  <Length>12</Length>
                  <Width>12</Width>
                  <Height>12</Height>
                  <Units>IN</Units>
               </Dimensions>
               <CustomerReferences>
                  <CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
                  <Value>TC001_01_PT1_ST01_PK01_SNDUS_RCPCA_POS</Value>
               </CustomerReferences>
            </RequestedPackageLineItems>
         </RequestedShipment>
      </RateRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


Response:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <RateReply xmlns="http://fedex.com/ws/rate/v24">
         <HighestSeverity>SUCCESS</HighestSeverity>
         <Notifications>
            <Severity>SUCCESS</Severity>
            <Source>crs</Source>
            <Code>0</Code>
            <Message>Request was successfully processed.</Message>
            <LocalizedMessage>Request was successfully processed.</LocalizedMessage>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>TC251_International Express With RETURN_SHIPMENT</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>crs</ServiceId>
            <Major>24</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RateReplyDetails>
            <ServiceType>INTERNATIONAL_PRIORITY</ServiceType>
            <ServiceDescription>
               <ServiceType>INTERNATIONAL_PRIORITY</ServiceType>
               <Code>01</Code>
               <Names>
                  <Type>abbrv</Type>
                  <Encoding>utf-8</Encoding>
                  <Value>IP</Value>
               </Names>
               <Names>
                  <Type>long</Type>
                  <Encoding>utf-8</Encoding>
                  <Value>FedEx International Priority®</Value>
               </Names>
               <Names>
                  <Type>long</Type>
                  <Encoding>ascii</Encoding>
                  <Value>FedEx International Priority</Value>
               </Names>
               <Names>
                  <Type>medium</Type>
                  <Encoding>utf-8</Encoding>
                  <Value>FedEx International Priority®</Value>
               </Names>
               <Names>
                  <Type>medium</Type>
                  <Encoding>ascii</Encoding>
                  <Value>FedEx International Priority</Value>
               </Names>
               <Names>
                  <Type>short</Type>
                  <Encoding>utf-8</Encoding>
                  <Value>IP</Value>
               </Names>
               <Names>
                  <Type>short</Type>
                  <Encoding>ascii</Encoding>
                  <Value>IP</Value>
               </Names>
               <Description>International Priority</Description>
               <AstraDescription>IP</AstraDescription>
            </ServiceDescription>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <DestinationAirportId>CDG</DestinationAirportId>
            <IneligibleForMoneyBackGuarantee>false</IneligibleForMoneyBackGuarantee>
            <OriginServiceArea>A2</OriginServiceArea>
            <DestinationServiceArea>A1</DestinationServiceArea>
            <SignatureOption>SERVICE_DEFAULT</SignatureOption>
            <ActualRateType>PAYOR_ACCOUNT_SHIPMENT</ActualRateType>
            <RatedShipmentDetails>
               <EffectiveNetDiscount>
                  <Currency>USD</Currency>
                  <Amount>15.48</Amount>
               </EffectiveNetDiscount>
               <ShipmentRateDetail>
                  <RateType>PAYOR_ACCOUNT_SHIPMENT</RateType>
                  <RateScale>0000000</RateScale>
                  <RateZone>GB001O</RateZone>
                  <PricingCode>ACTUAL</PricingCode>
                  <RatedWeightMethod>ACTUAL</RatedWeightMethod>
                  <CurrencyExchangeRate>
                     <FromCurrency>UKL</FromCurrency>
                     <IntoCurrency>USD</IntoCurrency>
                     <Rate>1.34</Rate>
                  </CurrencyExchangeRate>
                  <DimDivisor>139</DimDivisor>
                  <DimDivisorType>COUNTRY</DimDivisorType>
                  <FuelSurchargePercent>15.0</FuelSurchargePercent>
                  <TotalBillingWeight>
                     <Units>LB</Units>
                     <Value>20.0</Value>
                  </TotalBillingWeight>
                  <TotalBaseCharge>
                     <Currency>USD</Currency>
                     <Amount>151.07</Amount>
                  </TotalBaseCharge>
                  <TotalFreightDiscounts>
                     <Currency>USD</Currency>
                     <Amount>7.56</Amount>
                  </TotalFreightDiscounts>
                  <TotalNetFreight>
                     <Currency>USD</Currency>
                     <Amount>143.51</Amount>
                  </TotalNetFreight>
                  <TotalSurcharges>
                     <Currency>USD</Currency>
                     <Amount>21.53</Amount>
                  </TotalSurcharges>
                  <TotalNetFedExCharge>
                     <Currency>USD</Currency>
                     <Amount>165.04</Amount>
                  </TotalNetFedExCharge>
                  <TotalTaxes>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalTaxes>
                  <TotalNetCharge>
                     <Currency>USD</Currency>
                     <Amount>165.04</Amount>
                  </TotalNetCharge>
                  <TotalRebates>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalRebates>
                  <TotalDutiesAndTaxes>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalDutiesAndTaxes>
                  <TotalAncillaryFeesAndTaxes>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalAncillaryFeesAndTaxes>
                  <TotalDutiesTaxesAndFees>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalDutiesTaxesAndFees>
                  <TotalNetChargeWithDutiesAndTaxes>
                     <Currency>USD</Currency>
                     <Amount>165.04</Amount>
                  </TotalNetChargeWithDutiesAndTaxes>
                  <FreightDiscounts>
                     <RateDiscountType>EARNED</RateDiscountType>
                     <Description>Grace</Description>
                     <Amount>
                        <Currency>USD</Currency>
                        <Amount>7.56</Amount>
                     </Amount>
                     <Percent>5.0</Percent>
                  </FreightDiscounts>
                  <FreightDiscounts>
                     <RateDiscountType>OTHER</RateDiscountType>
                     <Description>Other</Description>
                     <Amount>
                        <Currency>USD</Currency>
                        <Amount>0.0</Amount>
                     </Amount>
                     <Percent>0.0</Percent>
                  </FreightDiscounts>
                  <Surcharges>
                     <SurchargeType>FUEL</SurchargeType>
                     <Description>Fuel</Description>
                     <Amount>
                        <Currency>USD</Currency>
                        <Amount>21.53</Amount>
                     </Amount>
                  </Surcharges>
               </ShipmentRateDetail>
            </RatedShipmentDetails>
            <RatedShipmentDetails>
               <ShipmentRateDetail>
                  <RateType>PAYOR_LIST_SHIPMENT</RateType>
                  <RateScale>0000000</RateScale>
                  <RateZone>GB001O</RateZone>
                  <PricingCode>ACTUAL</PricingCode>
                  <RatedWeightMethod>ACTUAL</RatedWeightMethod>
                  <CurrencyExchangeRate>
                     <FromCurrency>UKL</FromCurrency>
                     <IntoCurrency>USD</IntoCurrency>
                     <Rate>1.34</Rate>
                  </CurrencyExchangeRate>
                  <DimDivisor>139</DimDivisor>
                  <DimDivisorType>COUNTRY</DimDivisorType>
                  <FuelSurchargePercent>19.5</FuelSurchargePercent>
                  <TotalBillingWeight>
                     <Units>LB</Units>
                     <Value>20.0</Value>
                  </TotalBillingWeight>
                  <TotalBaseCharge>
                     <Currency>USD</Currency>
                     <Amount>151.07</Amount>
                  </TotalBaseCharge>
                  <TotalFreightDiscounts>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalFreightDiscounts>
                  <TotalNetFreight>
                     <Currency>USD</Currency>
                     <Amount>151.07</Amount>
                  </TotalNetFreight>
                  <TotalSurcharges>
                     <Currency>USD</Currency>
                     <Amount>29.45</Amount>
                  </TotalSurcharges>
                  <TotalNetFedExCharge>
                     <Currency>USD</Currency>
                     <Amount>180.52</Amount>
                  </TotalNetFedExCharge>
                  <TotalTaxes>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalTaxes>
                  <TotalNetCharge>
                     <Currency>USD</Currency>
                     <Amount>180.52</Amount>
                  </TotalNetCharge>
                  <TotalRebates>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalRebates>
                  <TotalDutiesAndTaxes>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalDutiesAndTaxes>
                  <TotalAncillaryFeesAndTaxes>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalAncillaryFeesAndTaxes>
                  <TotalDutiesTaxesAndFees>
                     <Currency>USD</Currency>
                     <Amount>0.0</Amount>
                  </TotalDutiesTaxesAndFees>
                  <TotalNetChargeWithDutiesAndTaxes>
                     <Currency>USD</Currency>
                     <Amount>180.52</Amount>
                  </TotalNetChargeWithDutiesAndTaxes>
                  <Surcharges>
                     <SurchargeType>FUEL</SurchargeType>
                     <Description>Fuel</Description>
                     <Amount>
                        <Currency>USD</Currency>
                        <Amount>29.45</Amount>
                     </Amount>
                  </Surcharges>
               </ShipmentRateDetail>
            </RatedShipmentDetails>
         </RateReplyDetails>
      </RateReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


Additional Info:
URL:https://wsdrt.idev.fedex.com:443/web-services
Date:Thu Dec 14 13:02:06 IST 2017
TimeTaken:4612ms
